#include <PR/ultratypes.h>
#include <assert.h>
#include <stdbool.h>
#include <string.h>
#include <stdio.h>
#include "data/dynos_cmap.cpp.h"

#define SPRITE_INDEX_START_CHAR '!'

struct SmCodeGlyph {
    char unicode[4];
    char base;
    f32 width;
    u32 spriteIndex;
};

struct SmCodeGlyph sSmCodeGlyphs[] = {
    { "Á", 'A', 0, 0 },
    { "Å", 'A', 0, 0 },
    { "Â", 'A', 0, 0 },
    { "À", 'A', 0, 0 },
    { "Ã", 'A', 0, 0 },
    { "Ä", 'A', 0, 0 },
    { "Ç", 'C', 0, 0 },
    { "É", 'E', 0, 0 },
    { "Ê", 'E', 0, 0 },
    { "È", 'E', 0, 0 },
    { "Ë", 'E', 0, 0 },
    { "Í", 'I', 0, 0 },
    { "Î", 'I', 0, 0 },
    { "Ì", 'I', 0, 0 },
    { "Ï", 'I', 0, 0 },
    { "Ñ", 'N', 0, 0 },
    { "Ó", 'O', 0, 0 },
    { "Ô", 'O', 0, 0 },
    { "Ò", 'O', 0, 0 },
    { "Õ", 'O', 0, 0 },
    { "Ö", 'O', 0, 0 },
    { "Ú", 'U', 0, 0 },
    { "Û", 'U', 0, 0 },
    { "Ù", 'U', 0, 0 },
    { "Ü", 'U', 0, 0 },
    { "Ý", 'Y', 0, 0 },
    { "Ÿ", 'Y', 0, 0 },

    { "á", 'a', 0, 0 },
    { "å", 'a', 0, 0 },
    { "â", 'a', 0, 0 },
    { "à", 'a', 0, 0 },
    { "ã", 'a', 0, 0 },
    { "ä", 'a', 0, 0 },
    { "ç", 'c', 0, 0 },
    { "é", 'e', 0, 0 },
    { "ê", 'e', 0, 0 },
    { "è", 'e', 0, 0 },
    { "ë", 'e', 0, 0 },
    { "í", 'i', 0, 0 },
    { "î", 'i', 0, 0 },
    { "ì", 'i', 0, 0 },
    { "ï", 'i', 0, 0 },
    { "ñ", 'n', 0, 0 },
    { "ó", 'o', 0, 0 },
    { "ô", 'o', 0, 0 },
    { "ò", 'o', 0, 0 },
    { "õ", 'o', 0, 0 },
    { "ö", 'o', 0, 0 },
    { "ú", 'u', 0, 0 },
    { "û", 'u', 0, 0 },
    { "ù", 'u', 0, 0 },
    { "ü", 'u', 0, 0 },
    { "ý", 'y', 0, 0 },
    { "ÿ", 'y', 0, 0 },

    { "æ", 'a', 15, 0 },
    { "Æ", 'a', 16, 0 },
    { "œ", 'o', 15, 0 },
    { "Œ", 'o', 16, 0 },
    { "ð", 'd', 0, 0 },
    { "Ð", 'D', 14, 0 },
    { "ø", 'o', 0, 0 },
    { "Ø", 'O', 0, 0 },
    { "ß", 'S', 0, 0 },

    { "¡", '!', 0, 0 },
    { "¿", '?', 0, 0 },

    { "Б", 15, 0, 0 },
    { "Г", 14, 0, 0 },
    { "Д", 17, 0, 0 },
    { "Ж", 17, 0, 0 },
    { "З", 13, 0, 0 },
    { "И", 15, 0, 0 },
    { "Й", 15, 0, 0 },
    { "Л", 13, 0, 0 },
    { "П", 14, 0, 0 },
    { "У", 12, 0, 0 },
    { "Ф", 17, 0, 0 },
    { "Ц", 14, 0, 0 },
    { "Ч", 11, 0, 0 },
    { "Ш", 17, 0, 0 },
    { "Щ", 17, 0, 0 },
    { "Ъ", 13, 0, 0 },
    { "Ы", 17, 0, 0 },
    { "Ь", 12, 0, 0 },
    { "Ѣ", 14, 0, 0 },
    { "Э", 13, 0, 0 },
    { "Ю", 17, 0, 0 },
    { "Я", 13, 0, 0 },
    { "Є", 12, 0, 0 },

    { "а", 13, 0, 0 },
    { "б", 11, 0, 0 },
    { "в", 11, 0, 0 },
    { "г", 10, 0, 0 },
    { "д", 12, 0, 0 },
    { "ж", 15, 0, 0 },
    { "з", 13, 0, 0 },
    { "и", 12, 0, 0 },
    { "й", 12, 0, 0 },
    { "к",  9, 0, 0 },
    { "л", 10, 0, 0 },
    { "м", 11, 0, 0 },
    { "н", 11, 0, 0 },
    { "п", 11, 0, 0 },
    { "т", 11, 0, 0 },
    { "ф", 14, 0, 0 },
    { "ц", 11, 0, 0 },
    { "ч",  9, 0, 0 },
    { "ш", 17, 0, 0 },
    { "щ", 17, 0, 0 },
    { "ъ", 14, 0, 0 },
    { "ы", 17, 0, 0 },
    { "ь", 12, 0, 0 },
    { "ѣ", 13, 0, 0 },
    { "э", 12, 0, 0 },
    { "ю", 16, 0, 0 },
    { "я", 12, 0, 0 },
    { "є", 12, 0, 0 },

    { "Č", 'C', 0, 0 },
    { "č", 'c', 0, 0 },
    { "Ě", 'E', 0, 0 },
    { "ě", 'e', 0, 0 },
    { "Š", 'S', 0, 0 },
    { "š", 's', 0, 0 },
    { "Ř", 'R', 0, 0 },
    { "ř", 'r', 0, 0 },
    { "Ž", 'Z', 0, 0 },
    { "ž", 'z', 0, 0 },
    { "Ů", 'U', 0, 0 },
    { "ů", 'u', 0, 0 },
    { "Ď", 'D', 0, 0 },
    { "ď", 'd', 0, 0 },
    { "Ň", 'N', 0, 0 },
    { "ň", 'n', 0, 0 },
    { "Ť", 'T', 0, 0 },
    { "ť", 13, 0, 0 },

    { "ę", 'e', 0, 0 },
    { "ń", 'n', 0, 0 },
    { "ś", 's', 0, 0 },
    { "ć", 'c', 0, 0 },
    { "ź", 'z', 0, 0 },
    { "ż", 'z', 0, 0 },
    { "ł", 'l', 0, 0 },
    { "Ę", 'E', 0, 0 },
    { "Ń", 'N', 0, 0 },
    { "Ś", 'S', 0, 0 },
    { "Ć", 'C', 0, 0 },
    { "Ź", 'Z', 0, 0 },
    { "Ż", 'Z', 0, 0 },
    { "Ł", 'L', 0, 0 },
    { "Ą", 'A', 0, 0 },
    { "ą", 'a', 0, 0 },
    { "Ї", 'l', 0, 0 },
    { "ї", 'l', 0, 0 },
    { "Ґ", 'R', 0, 0 },
    { "ґ", 'R', 0, 0 },
	
	{ "…", 8, 18, 0 },
	{ "、", 8, 18, 0 },
	{ "。", 8, 18, 0 },
	{ "『", 8, 18, 0 },
	{ "』", 8, 18, 0 },
	{ "ぁ", 8, 18, 0 },
	{ "あ", 8, 18, 0 },
	{ "ぃ", 8, 18, 0 },
	{ "い", 8, 18, 0 },
	{ "ぅ", 8, 18, 0 },
	{ "う", 8, 18, 0 },
	{ "ぇ", 8, 18, 0 },
	{ "え", 8, 18, 0 },
	{ "ぉ", 8, 18, 0 },
	{ "お", 8, 18, 0 },
	{ "か", 8, 18, 0 },
	{ "が", 8, 18, 0 },
	{ "き", 8, 18, 0 },
	{ "ぎ", 8, 18, 0 },
	{ "く", 8, 18, 0 },
	{ "ぐ", 8, 18, 0 },
	{ "け", 8, 18, 0 },
	{ "げ", 8, 18, 0 },
	{ "こ", 8, 18, 0 },
	{ "ご", 8, 18, 0 },
	{ "さ", 8, 18, 0 },
	{ "ざ", 8, 18, 0 },
	{ "し", 8, 18, 0 },
	{ "じ", 8, 18, 0 },
	{ "す", 8, 18, 0 },
	{ "ず", 8, 18, 0 },
	{ "せ", 8, 18, 0 },
	{ "ぜ", 8, 18, 0 },
	{ "そ", 8, 18, 0 },
	{ "ぞ", 8, 18, 0 },
	{ "た", 8, 18, 0 },
	{ "だ", 8, 18, 0 },
	{ "ち", 8, 18, 0 },
	{ "ぢ", 8, 18, 0 },
	{ "っ", 8, 18, 0 },
	{ "つ", 8, 18, 0 },
	{ "づ", 8, 18, 0 },
	{ "て", 8, 18, 0 },
	{ "で", 8, 18, 0 },
	{ "と", 8, 18, 0 },
	{ "ど", 8, 18, 0 },
	{ "な", 8, 18, 0 },
	{ "に", 8, 18, 0 },
	{ "ぬ", 8, 18, 0 },
	{ "ね", 8, 18, 0 },
	{ "の", 8, 18, 0 },
	{ "は", 8, 18, 0 },
	{ "ば", 8, 18, 0 },
	{ "ぱ", 8, 18, 0 },
	{ "ひ", 8, 18, 0 },
	{ "び", 8, 18, 0 },
	{ "ぴ", 8, 18, 0 },
	{ "ふ", 8, 18, 0 },
	{ "ぶ", 8, 18, 0 },
	{ "ぷ", 8, 18, 0 },
	{ "へ", 8, 18, 0 },
	{ "べ", 8, 18, 0 },
	{ "ぺ", 8, 18, 0 },
	{ "ほ", 8, 18, 0 },
	{ "ぼ", 8, 18, 0 },
	{ "ぽ", 8, 18, 0 },
	{ "ま", 8, 18, 0 },
	{ "み", 8, 18, 0 },
	{ "む", 8, 18, 0 },
	{ "め", 8, 18, 0 },
	{ "も", 8, 18, 0 },
	{ "ゃ", 8, 18, 0 },
	{ "や", 8, 18, 0 },
	{ "ゅ", 8, 18, 0 },
	{ "ゆ", 8, 18, 0 },
	{ "ょ", 8, 18, 0 },
	{ "よ", 8, 18, 0 },
	{ "ら", 8, 18, 0 },
	{ "り", 8, 18, 0 },
	{ "る", 8, 18, 0 },
	{ "れ", 8, 18, 0 },
	{ "ろ", 8, 18, 0 },
	{ "わ", 8, 18, 0 },
	{ "を", 8, 18, 0 },
	{ "ん", 8, 18, 0 },
	{ "ァ", 8, 18, 0 },
	{ "ア", 8, 18, 0 },
	{ "ィ", 8, 18, 0 },
	{ "イ", 8, 18, 0 },
	{ "ゥ", 8, 18, 0 },
	{ "ウ", 8, 18, 0 },
	{ "ェ", 8, 18, 0 },
	{ "エ", 8, 18, 0 },
	{ "ォ", 8, 18, 0 },
	{ "オ", 8, 18, 0 },
	{ "カ", 8, 18, 0 },
	{ "ガ", 8, 18, 0 },
	{ "キ", 8, 18, 0 },
	{ "ギ", 8, 18, 0 },
	{ "ク", 8, 18, 0 },
	{ "グ", 8, 18, 0 },
	{ "ケ", 8, 18, 0 },
	{ "ゲ", 8, 18, 0 },
	{ "コ", 8, 18, 0 },
	{ "ゴ", 8, 18, 0 },
	{ "サ", 8, 18, 0 },
	{ "ザ", 8, 18, 0 },
	{ "シ", 8, 18, 0 },
	{ "ジ", 8, 18, 0 },
	{ "ス", 8, 18, 0 },
	{ "ズ", 8, 18, 0 },
	{ "セ", 8, 18, 0 },
	{ "ゼ", 8, 18, 0 },
	{ "ソ", 8, 18, 0 },
	{ "ゾ", 8, 18, 0 },
	{ "タ", 8, 18, 0 },
	{ "ダ", 8, 18, 0 },
	{ "チ", 8, 18, 0 },
	{ "ヂ", 8, 18, 0 },
	{ "ッ", 8, 18, 0 },
	{ "ツ", 8, 18, 0 },
	{ "ヅ", 8, 18, 0 },
	{ "テ", 8, 18, 0 },
	{ "デ", 8, 18, 0 },
	{ "ト", 8, 18, 0 },
	{ "ド", 8, 18, 0 },
	{ "ナ", 8, 18, 0 },
	{ "ニ", 8, 18, 0 },
	{ "ヌ", 8, 18, 0 },
	{ "ネ", 8, 18, 0 },
	{ "ノ", 8, 18, 0 },
	{ "ハ", 8, 18, 0 },
	{ "バ", 8, 18, 0 },
	{ "パ", 8, 18, 0 },
	{ "ヒ", 8, 18, 0 },
	{ "ビ", 8, 18, 0 },
	{ "ピ", 8, 18, 0 },
	{ "フ", 8, 18, 0 },
	{ "ブ", 8, 18, 0 },
	{ "プ", 8, 18, 0 },
	{ "ヘ", 8, 18, 0 },
	{ "ベ", 8, 18, 0 },
	{ "ペ", 8, 18, 0 },
	{ "ホ", 8, 18, 0 },
	{ "ボ", 8, 18, 0 },
	{ "ポ", 8, 18, 0 },
	{ "マ", 8, 18, 0 },
	{ "ミ", 8, 18, 0 },
	{ "ム", 8, 18, 0 },
	{ "メ", 8, 18, 0 },
	{ "モ", 8, 18, 0 },
	{ "ャ", 8, 18, 0 },
	{ "ヤ", 8, 18, 0 },
	{ "ュ", 8, 18, 0 },
	{ "ユ", 8, 18, 0 },
	{ "ョ", 8, 18, 0 },
	{ "ヨ", 8, 18, 0 },
	{ "ラ", 8, 18, 0 },
	{ "リ", 8, 18, 0 },
	{ "ル", 8, 18, 0 },
	{ "レ", 8, 18, 0 },
	{ "ロ", 8, 18, 0 },
	{ "ワ", 8, 18, 0 },
	{ "ヲ", 8, 18, 0 },
	{ "ン", 8, 18, 0 },
	{ "・", 8, 18, 0 },
	{ "ー", 8, 18, 0 },
	{ "一", 8, 18, 0 },
	{ "上", 8, 18, 0 },
	{ "下", 8, 18, 0 },
	{ "不", 8, 18, 0 },
	{ "中", 8, 18, 0 },
	{ "久", 8, 18, 0 },
	{ "了", 8, 18, 0 },
	{ "交", 8, 18, 0 },
	{ "付", 8, 18, 0 },
	{ "以", 8, 18, 0 },
	{ "体", 8, 18, 0 },
	{ "作", 8, 18, 0 },
	{ "使", 8, 18, 0 },
	{ "信", 8, 18, 0 },
	{ "修", 8, 18, 0 },
	{ "停", 8, 18, 0 },
	{ "傷", 8, 18, 0 },
	{ "入", 8, 18, 0 },
	{ "全", 8, 18, 0 },
	{ "公", 8, 18, 0 },
	{ "六", 8, 18, 0 },
	{ "再", 8, 18, 0 },
	{ "出", 8, 18, 0 },
	{ "分", 8, 18, 0 },
	{ "切", 8, 18, 0 },
	{ "初", 8, 18, 0 },
	{ "判", 8, 18, 0 },
	{ "別", 8, 18, 0 },
	{ "利", 8, 18, 0 },
	{ "制", 8, 18, 0 },
	{ "前", 8, 18, 0 },
	{ "力", 8, 18, 0 },
	{ "加", 8, 18, 0 },
	{ "効", 8, 18, 0 },
	{ "動", 8, 18, 0 },
	{ "化", 8, 18, 0 },
	{ "十", 8, 18, 0 },
	{ "去", 8, 18, 0 },
	{ "参", 8, 18, 0 },
	{ "受", 8, 18, 0 },
	{ "可", 8, 18, 0 },
	{ "右", 8, 18, 0 },
	{ "同", 8, 18, 0 },
	{ "名", 8, 18, 0 },
	{ "吐", 8, 18, 0 },
	{ "員", 8, 18, 0 },
	{ "在", 8, 18, 0 },
	{ "報", 8, 18, 0 },
	{ "境", 8, 18, 0 },
	{ "士", 8, 18, 0 },
	{ "変", 8, 18, 0 },
	{ "外", 8, 18, 0 },
	{ "大", 8, 18, 0 },
	{ "失", 8, 18, 0 },
	{ "始", 8, 18, 0 },
	{ "子", 8, 18, 0 },
	{ "字", 8, 18, 0 },
	{ "存", 8, 18, 0 },
	{ "守", 8, 18, 0 },
	{ "安", 8, 18, 0 },
	{ "定", 8, 18, 0 },
	{ "実", 8, 18, 0 },
	{ "対", 8, 18, 0 },
	{ "左", 8, 18, 0 },
	{ "帽", 8, 18, 0 },
	{ "度", 8, 18, 0 },
	{ "引", 8, 18, 0 },
	{ "弱", 8, 18, 0 },
	{ "強", 8, 18, 0 },
	{ "当", 8, 18, 0 },
	{ "心", 8, 18, 0 },
	{ "必", 8, 18, 0 },
	{ "応", 8, 18, 0 },
	{ "性", 8, 18, 0 },
	{ "情", 8, 18, 0 },
	{ "意", 8, 18, 0 },
	{ "感", 8, 18, 0 },
	{ "戻", 8, 18, 0 },
	{ "手", 8, 18, 0 },
	{ "抜", 8, 18, 0 },
	{ "択", 8, 18, 0 },
	{ "接", 8, 18, 0 },
	{ "描", 8, 18, 0 },
	{ "撃", 8, 18, 0 },
	{ "撮", 8, 18, 0 },
	{ "操", 8, 18, 0 },
	{ "改", 8, 18, 0 },
	{ "攻", 8, 18, 0 },
	{ "放", 8, 18, 0 },
	{ "敗", 8, 18, 0 },
	{ "数", 8, 18, 0 },
	{ "断", 8, 18, 0 },
	{ "新", 8, 18, 0 },
	{ "日", 8, 18, 0 },
	{ "早", 8, 18, 0 },
	{ "時", 8, 18, 0 },
	{ "更", 8, 18, 0 },
	{ "替", 8, 18, 0 },
	{ "最", 8, 18, 0 },
	{ "期", 8, 18, 0 },
	{ "未", 8, 18, 0 },
	{ "本", 8, 18, 0 },
	{ "検", 8, 18, 0 },
	{ "楽", 8, 18, 0 },
	{ "次", 8, 18, 0 },
	{ "止", 8, 18, 0 },
	{ "正", 8, 18, 0 },
	{ "歳", 8, 18, 0 },
	{ "死", 8, 18, 0 },
	{ "永", 8, 18, 0 },
	{ "注", 8, 18, 0 },
	{ "流", 8, 18, 0 },
	{ "消", 8, 18, 0 },
	{ "満", 8, 18, 0 },
	{ "無", 8, 18, 0 },
	{ "版", 8, 18, 0 },
	{ "環", 8, 18, 0 },
	{ "生", 8, 18, 0 },
	{ "用", 8, 18, 0 },
	{ "由", 8, 18, 0 },
	{ "画", 8, 18, 0 },
	{ "界", 8, 18, 0 },
	{ "番", 8, 18, 0 },
	{ "的", 8, 18, 0 },
	{ "直", 8, 18, 0 },
	{ "知", 8, 18, 0 },
	{ "確", 8, 18, 0 },
	{ "示", 8, 18, 0 },
	{ "禁", 8, 18, 0 },
	{ "突", 8, 18, 0 },
	{ "終", 8, 18, 0 },
	{ "続", 8, 18, 0 },
	{ "緑", 8, 18, 0 },
	{ "緩", 8, 18, 0 },
	{ "者", 8, 18, 0 },
	{ "能", 8, 18, 0 },
	{ "自", 8, 18, 0 },
	{ "葉", 8, 18, 0 },
	{ "行", 8, 18, 0 },
	{ "衝", 8, 18, 0 },
	{ "表", 8, 18, 0 },
	{ "袋", 8, 18, 0 },
	{ "補", 8, 18, 0 },
	{ "要", 8, 18, 0 },
	{ "見", 8, 18, 0 },
	{ "言", 8, 18, 0 },
	{ "討", 8, 18, 0 },
	{ "設", 8, 18, 0 },
	{ "許", 8, 18, 0 },
	{ "認", 8, 18, 0 },
	{ "語", 8, 18, 0 },
	{ "読", 8, 18, 0 },
	{ "赤", 8, 18, 0 },
	{ "起", 8, 18, 0 },
	{ "距", 8, 18, 0 },
	{ "転", 8, 18, 0 },
	{ "込", 8, 18, 0 },
	{ "追", 8, 18, 0 },
	{ "退", 8, 18, 0 },
	{ "送", 8, 18, 0 },
	{ "逆", 8, 18, 0 },
	{ "造", 8, 18, 0 },
	{ "進", 8, 18, 0 },
	{ "違", 8, 18, 0 },
	{ "遠", 8, 18, 0 },
	{ "適", 8, 18, 0 },
	{ "選", 8, 18, 0 },
	{ "部", 8, 18, 0 },
	{ "量", 8, 18, 0 },
	{ "開", 8, 18, 0 },
	{ "間", 8, 18, 0 },
	{ "限", 8, 18, 0 },
	{ "離", 8, 18, 0 },
	{ "青", 8, 18, 0 },
	{ "非", 8, 18, 0 },
	{ "面", 8, 18, 0 },
	{ "音", 8, 18, 0 },
	{ "響", 8, 18, 0 },
	{ "！", 8, 18, 0 },
	{ "（", 8, 18, 0 },
	{ "）", 8, 18, 0 },
	{ "＜", 8, 18, 0 },
	{ "＞", 8, 18, 0 },
	{ "？", 8, 18, 0 },
	{ "～", 8, 18, 0 },
};

struct SmCodeGlyph sSmCodeDuplicateGlyphs[] = {
    { "А", 'A', 0, 0 },
    { "В", 'B', 0, 0 },
    { "Е", 'E', 0, 0 },
    { "К", 'K', 0, 0 },
    { "М", 'M', 0, 0 },
    { "Н", 'H', 0, 0 },
    { "О", 'O', 0, 0 },
    { "Р", 'P', 0, 0 },
    { "С", 'C', 0, 0 },
    { "Т", 'T', 0, 0 },
    { "Х", 'X', 0, 0 },
    { "е", 'e', 0, 0 },
    { "о", 'o', 0, 0 },
    { "р", 'p', 0, 0 },
    { "с", 'c', 0, 0 },
    { "у", 'y', 0, 0 },
    { "х", 'x', 0, 0 },
};

static void* sCharMap = NULL;
static void* sCharIter = NULL;

static s32 count_bytes_for_char(char* text) {
    s32 bytes = 0;
    u8 mask = (1 << 7);
    while (*text & mask) {
        bytes++;
        mask >>= 1;
    }
    return bytes ? bytes : 1;
}

static u64 convert_unicode_char_to_u64(char* text) {
    s32 bytes = count_bytes_for_char(text);
    u64 value = (u8)*text;

    // HACK: we only support up to 4 bytes per character
    if (bytes > 4) { return 0; }

    bytes--;
    while (bytes > 0) {
        value <<= 8;
        value |= (u8)*(++text);
        bytes--;
        //text++; //commenting this out bc it messes up the keys for japanese
    }
    return value;
}

void djui_unicode_init(void) {
    sCharMap = hmap_create();
    sCharIter = hmap_iter(sCharMap);

    size_t glyphCount = sizeof(sSmCodeGlyphs) / sizeof(sSmCodeGlyphs[0]);
    for (size_t i = 0; i < glyphCount; i++) {
        struct SmCodeGlyph* glyph = &sSmCodeGlyphs[i];
        glyph->spriteIndex = (128 + i) - SPRITE_INDEX_START_CHAR;
		
        u64 key = convert_unicode_char_to_u64(glyph->unicode);
        s32 bytes = count_bytes_for_char(glyph->unicode);
		
        assert(bytes >= 2 && bytes <= 4);
        assert(key > 127);
        hmap_put(sCharMap, key, glyph);
    }

    // add duplicate glyphs
    size_t dupCount = sizeof(sSmCodeDuplicateGlyphs) / sizeof(sSmCodeDuplicateGlyphs[0]);
    for (size_t i = 0; i < dupCount; i++) {
        struct SmCodeGlyph* glyph = &sSmCodeDuplicateGlyphs[i];
        assert((u32)glyph->base < 128);
        assert((u32)glyph->base > SPRITE_INDEX_START_CHAR);
        glyph->spriteIndex = ((u32)glyph->base) - SPRITE_INDEX_START_CHAR;

        u64 key = convert_unicode_char_to_u64(glyph->unicode);
        s32 bytes = count_bytes_for_char(glyph->unicode);
        assert(bytes >= 2 && bytes <= 4);
        assert(key > 127);
        hmap_put(sCharMap, key, glyph);
    }
}

u32 djui_unicode_get_sprite_index(char* text) {
    // check for ASCI
    if ((u8)*text < 128) {
        // make sure it's in the valid range
        if ((u8)*text < SPRITE_INDEX_START_CHAR) {
            return (u8)'?' - SPRITE_INDEX_START_CHAR;
        }

        // output the ASCII index
        return (u8)*text - SPRITE_INDEX_START_CHAR;
    }

    // retrieve the character
    u64 key = convert_unicode_char_to_u64(text);
	
    // retrieve the sprite glyph
    struct SmCodeGlyph* glyph = hmap_get(sCharMap, key);
    if (glyph) {
		return glyph->spriteIndex;
    }
	
    return (u8)'?' - SPRITE_INDEX_START_CHAR;
}

f32 djui_unicode_get_sprite_width(char* text, const f32 font_widths[], f32 unicodeScale) {
    if (!text) { return 0; }

    // check for ASCII
    if ((u8)*text < 128) {
        // make sure it's in the valid range
        if ((u8)*text < SPRITE_INDEX_START_CHAR) {
            return font_widths[(u8)'?' - SPRITE_INDEX_START_CHAR];
        }

        // output the ASCII width
        return font_widths[(u8)*text - SPRITE_INDEX_START_CHAR];
    }

    // retrieve the character
    u64 key = convert_unicode_char_to_u64(text);

    // retrieve the glyph
    struct SmCodeGlyph* glyph = hmap_get(sCharMap, key);
    if (glyph) {
        if (glyph->width) {
            // use the custom width
            return glyph->width / unicodeScale;
        }
        if ((u8)glyph->base < (u8)'!') {
            return glyph->base / unicodeScale;
        }
        // use the base width
        return font_widths[(u8)glyph->base - SPRITE_INDEX_START_CHAR];
    }

    // return default value
    return font_widths[(u8)'?' - SPRITE_INDEX_START_CHAR];
}

char* djui_unicode_next_char(char* text) {
    s32 bytes = count_bytes_for_char(text);
    while (bytes-- > 0) {
        if (*text == '\0') { return text; }
        text++;
    }
    return text;
}

char* djui_unicode_at_index(char* text, s32 index) {
    while (index-- > 0) {
        text = djui_unicode_next_char(text);
    }
    return text;
}

size_t djui_unicode_len(char* text) {
    size_t len = 0;
    while (*text) {
        text = djui_unicode_next_char(text);
        len++;
    }
    return len;
}

bool djui_unicode_valid_char(char* text) {
    if ((u8)*text < 128) {
        return ((u8)*text >= ' ');
    }
    u64 key = convert_unicode_char_to_u64(text);
    struct SmCodeGlyph* glyph = hmap_get(sCharMap, key);
    return glyph != NULL;
}

void djui_unicode_cleanup_end(char* text) {
    s32 slen = strlen(text);
    s32 idx = strlen(text);
    bool foundMulti = false;
    if (idx < 2) { return; }
    idx--;

    // look for the start of a byte sequence
    while (idx >= 0 && text[idx] & (1 << 7)) {
        foundMulti = true;
        if ((text[idx] & 192) == 192) {
            break;
        }
        idx--;
    }

    if (!foundMulti) { return; }
    if (idx < 0) { return; }

    s32 bytes = count_bytes_for_char(&text[idx]);
    if (bytes <= 1) {
        text[idx] = '\0';
        return;
    }

    if ((slen - idx) != bytes) {
        text[idx] = '\0';
    }
}

char djui_unicode_get_base_char(char* text) {
    if ((u8)*text < ' ') { return '?'; }
    if ((u8)*text < 128) { return *text; }
    if (!sCharMap) { return '?'; }
    u64 key = convert_unicode_char_to_u64(text);
    struct SmCodeGlyph* glyph = hmap_get(sCharMap, key);
    return (glyph != NULL || ((u8)glyph->base < (u8)'!')) ? glyph->base : '?';
}

void djui_unicode_get_char(char* text, char* output) {
    s32 bytes = count_bytes_for_char(text);
    while (bytes-- > 0) {
        *output = *text;
        output++;
        text++;
    }
    *output = '\0';
}
